base-case/curiosityFluidsAirfoilMesher/mesh2/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    farfield
    {
        type            calculated;
        value           uniform 0;
    }
    airfoil
    {
        type            calculated;
        value           nonuniform List<scalar> 
341
(
0.280426
0.281565
0.282964
0.283993
0.285481
0.287432
0.289439
0.291788
...
)
;
    }
}


// ************************************************************************* //
